angry-ip-scanner
anki
dbeaver-community
discord
docker
firefox
flycut
font-iosevka
font-iosevka-slab
font-overpass
font-roboto-mono
font-victor-mono
google-cloud-sdk
hammerspoon
intellij-idea-ce
karabiner-elements
kitty
spotify
tailscale
utm
vscodium
wezterm
